app/controllers/api/tasks_controller.rb

INSERT INTO "tasks" ("name", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Here is my third task and I do hope it saves"], ["creator_id", 6], ["created_at", "2016-03-31 09:39:26.476708"], ["updated_at", "2016-03-31 09:39:26.476708"]]
---
  def create
    @task = current_user.tasks.new(task_params)

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "more work for youp"], ["updated_at", "2016-03-30 23:25:30.492433"], ["id", 2]]
---
  def update
    @task = Task.find(params[:id])
    @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
---
    task = Task.find(params[:id])
    task.destroy