app/views/api/tasks/_task.json.jbuilder


task_created_date = task.created_at.to_date
---
INSERT INTO "tasks" ("name", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Here is my third task and I do hope it saves"], ["creator_id", 6], ["created_at", "2016-03-31 09:39:26.476708"], ["updated_at", "2016-03-31 09:39:26.476708"]]